"use strict";

const userNames = ["Петрик Ольга Іванівна", "Хомич Любов Леонідівна", "Гнатюк Петро Антонович", "Рудко Андрій Опанасович"];
let initials;

//створюємо новий масив на основі вхідного
initials = userNames.map ( (name) => {
    return name.split(" ").reduce( (accumulator, currentValue) => {  //який розділить слова в рядку в масив і тоді в акумулятор
        accumulator += currentValue[0] + ".";          //для кожного елемента-юзера скопіює перші букви і розділить їх "."; переведу на всякий випадок букву до верхнього регістру 
        return accumulator;                                          //повернемо акумулятор
    }, "");
}).sort();                                                           //відсортуємо отриматй масив (без параметрів - по алфавіту, що нам і треба, до того ж - перші букви всі великі, сортування має бути адекватне)

console.log("userNames : ", userNames); 
console.log("initials : ", initials); // [ "Г.П.А.", "П.О.І.", "Р.А.О."]  